mafeiGitHub/stm32Mp3/src/main.cpp
// main.cpp
//{{{  includes
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include <stdint.h>
#include <math.h>

#include "memory.h"
#include "cmsis_os.h"

#include "lwip/netif.h"
#include "lwip/tcpip.h"
#include "lwip/dhcp.h"
#include "ipv4/lwip/ip_addr.h"
#include "lwip/api.h"
#include "os/ethernetif.h"

#include "cHttp.h"
#include "../httpServer/httpServer.h"

#ifdef STM32F746G_DISCO
  #include "stm32746g_discovery.h"
  #include "stm32746g_discovery_ts.h"
  #include "stm32746g_discovery_audio.h"
  #include "stm32746g_discovery_sd.h"
#else
  #include "stm32f769i_discovery.h"
  #include "stm32f769i_discovery_ts.h"
  #include "stm32f769i_discovery_audio.h"
  #include "stm32f769i_discovery_sd.h"
#endif

#include "../fatfs/fatFs.h"

#include "decoders/cMp3decoder.h"
#include "../aac/neaacdec.h"

#include "cLcd.h"
#include "widgets/cRootContainer.h"
#include "widgets/cWidget.h"
#include "widgets/cListWidget.h"
#include "widgets/cTextBox.h"
#include "widgets/cValueBox.h"
#include "widgets/cWaveWidget.h"
#include "widgets/cWaveCentreWidget.h"
#include "widgets/cWaveLensWidget.h"
//}}}
//{{{  static const
static const bool kMaxTouch = 1;
static const bool kStaticIp = false;
//}}}
//{{{  static vars
static osSemaphoreId mAudSem;
static bool mAudHalf = false;

static float mVolume = 0.7f;
static int mIntVolume = 0;
static bool mVolumeChanged = false;

// mp3
static std::vector<std::string> mMp3Files;
static int fileIndex = 0;
static bool fileIndexChanged = false;

static int mPlayFrame = 0;
static int mLoadFrame = 0;

static int* mFrameOffsets = nullptr;
static uint8_t* mWave = nullptr;
static bool mWaveChanged = false;
static bool mWaveLoad = false;

// hls
static osSemaphoreId mHlsLoaderSem;
static std::string mInfoStr;
static int mTuneChan = 4;

// ui
static cLcd* mLcd = nullptr;
static cRootContainer* mRoot = nullptr;
//}}}
//{{{  audio callbacks
//{{{
void BSP_AUDIO_OUT_HalfTransfer_CallBack() {
  mAudHalf = true;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_TransferComplete_CallBack() {
  mAudHalf = false;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//}}}

//{{{
class cHlsChan {
public:
  cHlsChan() {}
  virtual ~cHlsChan() {}

  // gets
  int getChan() { return mChan; }
  int getSampleRate() { return kSampleRate; }
  int getSamplesPerFrame() { return kSamplesPerFrame; }
  int getFramesPerChunk() { return kFramesPerChunk; }
  int getFramesFromSec (int sec) { return int (sec * getFramesPerSecond()); }
  float getFramesPerSecond() { return (float)kSampleRate / (float)kSamplesPerFrame; }

  int getLowBitrate() { return 48000; }
  int getMidBitrate() { return 128000; }
  int getHighBitrate() { return 320000; }

  int getBaseSeqNum() { return mBaseSeqNum; }

  std::string getHost() { return mHost; }
  std::string getTsPath (int seqNum, int bitrate) { return getPathRoot (bitrate) + '-' + toString (seqNum) + ".ts"; }
  std::string getChanName (int chan) { return kChanNames [chan]; }
  std::string getDateTime() { return mDateTime; }
  std::string getChanInfoStr() { return mChanInfoStr; }

  // set
  //{{{
  void setChan (cHttp* http, int chan) {

    mChan = chan;
    mHost = "as-hls-uk-live.bbcfmt.vo.llnwd.net";

    cLcd::debug (mHost);
    if (http->get (mHost, getM3u8path()) == 302) {
      mHost = http->getRedirectedHost();
      http->get (mHost, getM3u8path());
      cLcd::debug (mHost);
      }
    else
      mHost = http->getRedirectedHost();
    cLcd::debug (getM3u8path());

    // find #EXT-X-MEDIA-SEQUENCE in .m3u8, point to seqNum string, extract seqNum from playListBuf
    auto extSeq = strstr ((char*)http->getContent(), "#EXT-X-MEDIA-SEQUENCE:") + strlen ("#EXT-X-MEDIA-SEQUENCE:");
    auto extSeqEnd = strchr (extSeq, '\n');
    *extSeqEnd = '\0';
    mBaseSeqNum = atoi (extSeq) + 3;

    auto extDateTime = strstr (extSeqEnd + 1, "#EXT-X-PROGRAM-DATE-TIME:") + strlen ("#EXT-X-PROGRAM-DATE-TIME:");
    auto extDateTimeEnd = strchr (extDateTime, '\n');
    *extDateTimeEnd = '\0';
    mDateTime = extDateTime;

    mChanInfoStr = toString (http->getResponse()) + ' ' + http->getInfoStr() + ' ' + getM3u8path() + ' ' + mDateTime;
    cLcd::debug (mDateTime + " " + cLcd::dec (mBaseSeqNum));
    }
  //}}}

private:
  //{{{  const
  const int kSampleRate = 48000;
  const int kSamplesPerFrame = 1024;
  const int kFramesPerChunk = 300;

  const int kPool        [7] = {      0,      7,      7,      7,      6,      6,      6 };
  const char* kChanNames [7] = { "none", "radio1", "radio2", "radio3", "radio4", "radio5", "radio6" };
  const char* kPathNames [7] = { "none", "bbc_radio_one", "bbc_radio_two", "bbc_radio_three",
                                         "bbc_radio_fourfm", "bbc_radio_five_live", "bbc_6music" };
  //}}}
  //{{{
  std::string getPathRoot (int bitrate) {
    return "pool_" + toString (kPool[mChan]) + "/live/" + kPathNames[mChan] + '/' + kPathNames[mChan] +
           ".isml/" + kPathNames[mChan] + "-audio=" + toString (bitrate);
    }
  //}}}
  std::string getM3u8path () { return getPathRoot (getMidBitrate()) + ".norewind.m3u8"; }

  // vars
  int mChan = 0;
  int mBaseSeqNum = 0;
  std::string mHost;
  std::string mDateTime;
  std::string mChanInfoStr;
  };
//}}}
//{{{
class cHlsChunk {
public:
  //{{{
  cHlsChunk() {
    mAudio = (int16_t*)pvPortMalloc (300 * 1024 * 2 * 2);
    mPower = (uint8_t*)malloc (300 * 2);
    }
  //}}}
  //{{{
  ~cHlsChunk() {
    NeAACDecClose (mDecoder);
    if (mPower)
      free (mPower);
    if (mAudio)
      vPortFree (mAudio);
    }
  //}}}

  // gets
  int getSeqNum() { return mSeqNum; }
  int getBitrate() { return mBitrate; }
  int getFramesLoaded() { return mFramesLoaded; }
  std::string getInfoStr() { return mInfoStr; }

  int16_t* getSamples (int frameInChunk) { return (mAudio + (frameInChunk * mSamplesPerFrame * 2)); }
  //{{{
  uint8_t* getPower (int frameInChunk, int& frames) {
    frames = getFramesLoaded() - frameInChunk;
    return mPower + (frameInChunk * 2);
    }
  //}}}

  //{{{
  bool load (cHttp* http, cHlsChan* hlsChan, int seqNum, int bitrate) {

    mFramesLoaded = 0;
    mSeqNum = seqNum;
    mBitrate = bitrate;

    auto response = http->get (hlsChan->getHost(), hlsChan->getTsPath (seqNum, mBitrate));
    if (response == 200) {
      // aacHE has double size frames, treat as two normal frames
      int framesPerAacFrame = mBitrate <= 48000 ? 2 : 1;
      mSamplesPerFrame = hlsChan->getSamplesPerFrame();
      int samplesPerAacFrame = mSamplesPerFrame * framesPerAacFrame;

      auto loadPtr = http->getContent();
      auto loadEnd = http->getContentEnd();
      loadEnd = packTsBuffer (loadPtr, loadEnd);

