mafeiGitHub/stm32Mp3/src/main.cpp
  //{{{
  bool findFrame (int frame, int& seqNum, int& chunk, int& frameInChunk) {
  // return true, seqNum, chunk and frameInChunk of loadedChunk from frame
  // - return false if not found

    auto findSeqNum = getSeqNumFromFrame (frame);
    for (auto i = 0; i < 3; i++) {
      if ((mChunks[i].getSeqNum() != 0) && (findSeqNum == mChunks[i].getSeqNum())) {
        auto findFrameInChunk = getFrameInChunkFromFrame (frame);
        if ((mChunks[i].getFramesLoaded() > 0) && (findFrameInChunk < mChunks[i].getFramesLoaded())) {
          seqNum = findSeqNum;
          chunk = i;
          frameInChunk = findFrameInChunk;
          return true;
          }
        }
      }

    seqNum = 0;
    chunk = 0;
    frameInChunk = 0;
    return false;
    }
  //}}}
  //{{{
  bool findSeqNumChunk (int seqNum, int bitrate, int offset, int& chunk) {
  // return true if match found
  // - if not, chunk = best reuse
  // - reuse same seqNum chunk if diff bitrate ?

    // look for matching chunk
    chunk = 0;
    while (chunk < 3) {
      if (seqNum + offset == mChunks[chunk].getSeqNum())
        return true;
        //return bitrate != mChunks[chunk].getBitrate();
      chunk++;
      }

    // look for stale chunk
    chunk = 0;
    while (chunk < 3) {
      if ((mChunks[chunk].getSeqNum() < seqNum-1) || (mChunks[chunk].getSeqNum() > seqNum+1))
        return false;
      chunk++;
      }

    chunk = 0;
    return false;
    }
  //}}}
  //{{{
  void invalidateChunks() {
    for (auto i = 0; i < 3; i++)
      mChunks[i].invalidate();
    }
  //}}}

  // private vars
  int mBaseFrame = 0;
  int mBitrate = 0;
  int mLoading = 0;
  std::string mInfoStr;
  cHlsChunk mChunks[3];
  };
//}}}
static cHlsLoader* mHlsLoader;

//{{{
class cPowerWidget : public cWidget {
public:
  cPowerWidget (cHlsLoader* hlsLoader, uint16_t width, uint16_t height) :
    cWidget (COL_BLUE, width, height), mHlsLoader(hlsLoader) {}
  virtual ~cPowerWidget() {}

  virtual void render (iDraw* draw) {
    uint8_t* power = nullptr;
    int frame = mPlayFrame - mWidth/2;
    int frames = 0;
    for (auto x = 0; x < mWidth; x++, frame++) {
      if (frames <= 0)
        power = mHlsLoader->getPower (frame, frames);
      if (power) {
        uint8_t top = *power++;
        uint8_t ylen = *power++;
        draw->rectClipped (COL_BLUE, x, top, 1, ylen);
        frames--;
        }
      }
    }
private:
  cHlsLoader* mHlsLoader;
  };
//}}}
//{{{
class cInfoTextBox : public cWidget {
public:
  cInfoTextBox (uint16_t width) : cWidget (width) {}
  virtual ~cInfoTextBox() {}

  virtual void render (iDraw* draw) {
    draw->text (COL_WHITE, getFontHeight(), mHlsLoader->getChunkInfoStr (0).c_str(), mX+2, mY+1, mWidth-1, mHeight-1);
    }
  };
//}}}

//{{{
static void aacLoadThread (void const* argument) {

  cLcd::debug ("aacLoadThread");

  mTuneChan = 4;
  mHlsLoader->setBitrate (mHlsLoader->getMidBitrate());

  cHttp http;
  while (true) {
    if (mHlsLoader->getChan() != mTuneChan) {
      mPlayFrame = mHlsLoader->changeChan (&http, mTuneChan) - mHlsLoader->getFramesFromSec (19);
      mHlsLoader->setBitrate (mHlsLoader->getMidBitrate());
      mLcd->setShowDebug (false, false, false, true);  // debug - title, info, lcdStats, footer
      }

    if (!mHlsLoader->load (&http, mPlayFrame))
      osDelay (1000);

    osSemaphoreWait (mHlsLoaderSem, osWaitForever);
    }
  }
//}}}
//{{{
static void aacPlayThread (void const* argument) {

  cLcd::debug ("aacPlayThread");

  #ifdef STM32F746G_DISCO
    BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_HEADPHONE, int(mVolume * 100), 48000);
    BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_02);
  #else
    BSP_AUDIO_OUT_Init (OUTPUT_DEVICE_SPEAKER, int(mVolume * 100), 48000);
    BSP_AUDIO_OUT_SetAudioFrameSlot (CODEC_AUDIOFRAME_SLOT_13);
  #endif

  memset ((void*)AUDIO_BUFFER, 0, 8192);
  BSP_AUDIO_OUT_Play ((uint16_t*)AUDIO_BUFFER, 8192);

  int lastSeqNum = 0;
  while (true) {
    if (osSemaphoreWait (mAudSem, 50) == osOK) {
      int seqNum;
      int16_t* audioSamples = mHlsLoader->getSamples (mPlayFrame, seqNum);
      if (audioSamples) {
        memcpy ((int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + 4096), audioSamples, 4096);
        mPlayFrame++;
        }
      else
        memset ((int16_t*)(mAudHalf ? AUDIO_BUFFER : AUDIO_BUFFER + 4096), 0, 4096);

      if (!seqNum || (seqNum != lastSeqNum)) {
        lastSeqNum = seqNum;
        osSemaphoreRelease (mHlsLoaderSem);
        }
      }
    }
  }
//}}}
//{{{
static void setPlayFrame (int frame) {
  mPlayFrame = frame;
  }
//}}}
//{{{
static void incPlayFrame (int inc) {
  setPlayFrame (mPlayFrame + inc);
  }
//}}}
//{{{
static void incAlignPlayFrame (int inc) {
  setPlayFrame (mPlayFrame + inc);
  }
//}}}

//{{{
static void listDirectory (std::string directoryName, std::string indent) {

  cLcd::debug ("dir " + directoryName);

  cDirectory directory (directoryName);
  if (directory.getError()) {
    //{{{  open error
    cLcd::debug (COL_RED, "directory open error:"  + cLcd::dec (directory.getError()));
    return;
    }
    //}}}

  cFileInfo fileInfo;
  while ((directory.find (fileInfo) == FR_OK) && !fileInfo.getEmpty()) {
    if (fileInfo.getBack()) {
      //cLcd::debug (fileInfo.getName());
      }

    else if (fileInfo.isDirectory())
      listDirectory (directoryName + "/" + fileInfo.getName(), indent + "-");

    else if (fileInfo.matchExtension ("MP3")) {
      mMp3Files.push_back (directoryName + "/" + fileInfo.getName());
      cLcd::debug (indent + fileInfo.getName());
      cFile file (directoryName + "/" + fileInfo.getName(), FA_OPEN_EXISTING | FA_READ);
      //cLcd::debug ("- filesize " + cLcd::intStr (file.getSize()));
      }
    }
  }
//}}}
//{{{
static void mp3PlayThread (void const* argument) {

  cLcd::debug ("mp3PlayThread");

  //{{{  mount fatfs
  cFatFs* fatFs = cFatFs::create();
  if (fatFs->mount() != FR_OK) {
    //{{{  fatfs mount error, return
    cLcd::debug ("fatFs mount problem");
    osThreadTerminate (NULL);
    return;
    }
    //}}}
  cLcd::debug (fatFs->getLabel() + " vsn:" + cLcd::hex (fatFs->getVolumeSerialNumber()) +
               " freeSectors:" + cLcd::dec (fatFs->getFreeSectors()));
  //}}}
  mLcd->setShowDebug (false, false, false, true);  // disable debug - title, info, lcdStats, footer

  listDirectory ("", "");

